[
    {
        "title": "Games",
        "entries": [
            {
                "label": "Tetris Flip",
                "link": "https://kenn-tran-37.itch.io/tetris-flip",
                "description": "A simple tetris game but with two mischievous characters messing with the board, flipping it horizontally or vertically.",
                "points": [
                    "Just for fun, I wanted to try recreating Tetris but with an added mechanism"
                ]
            },
            {
                "label": "Wronged Travel",
                "link": "https://kenn-tran-37.itch.io/wronged-travel",
                "description": "You, a traveller, get yourself involved with a some thugs on the streets tell you to give them your belongings.  After beating 'em up, a hunter comes across and somehow misunderstands the situation.. Thinking that you're the thug trying to take the local's belongings. Things escalate and now the authorities are after you..",
                "points": [
                    "In this game I tried exploring how to develop 2D games where the characters can move on both Axis, X and Y",
                    "Exploring algorithms to handle different enemy AI state behaviours"
                ]
            },
            {
                "label": "Samurai Cut",
                "link": "https://kenn-tran-37.itch.io/samurai-cut",
                "description": "A Samurai on a journey encountering rivals and obstacles.",
                "points": [
                    "A simple endless runner game exploring the style of mixing 2D sprites with the 3D environment"
                ]
            },
            {
                "label": "Final Test Subject",
                "link": "https://kenn-tran-37.itch.io/final-test-subject",
                "description": "As the final robot creation in the lab, you are tasked to clear and  survive through multiple rooms packed with robots that are also tasked  to destroy you.",
                "points": [
                    "A project where I played around with more of Unity’s features",
                    "In the project, I explored more about Unity’s Job and Burst System to handle A* Pathfinding Algorithm and explored more about Unity’s baked lighting system"
                ]
            },
            {
                "label": "Skull Temple",
                "link": "https://turbo-interactive.itch.io/skull-temple",
                "description": "A simple endless runner where you take on the rule of a skull boy running through the temple dodging dangerous obstacles whilst bashing robots that have entered the temple.",
                "points": [
                    "After graduating, a friend and I decided to make a game together",
                    "Since this game is an endless side-scrolling runner, I was able to learn more about how to handle generating obstacles and enemies in a procedural manner"
                ]
            },
            {
                "label": "Riot Shield",
                "link": "https://kenn-tran-37.itch.io/riot-shield",
                "description": "An endless runner game where you, as a Swat are tasked with destroying everything that comes in your path except a few things. As you destroy these objects, you will gain points to beat your own high score and gain coins to upgrade yourself and buy 5 other Swats from around the world.",
                "points": [
                    "Project was created for an assessment during university but a friend and I decided to properly completing it"
                ]
            }
        ]
    },
    {
        "title": "University Games",
        "entries": [
            {
                "label": "Experimental Games",
                "link": "https://experimentalgamedesign.itch.io/kenny-tran-experimental-games",
                "description": "Experimenting with 4 different themes; Seasons, Space, Racing, and Embodied Interaction or Tangile Media.",
                "points": [
                    "Seasons - The game had to encompass the theme of seasons. However, because we had to develop it in a software I wasn't familiar with, I was unable to contribute much to the project",
                    "Space - The game was based on the Player defending the space station from falling asteroids. By deflecting the asteroids when it gets near the shield",
                    "Racing - I made the game based on racing against time. Where the Player controls a plane around the map to reach checkpoints before the time runs out",
                    "Embodied Interaction or Tangile Media - I went to Embodied Interaction where the game is a rythem game where the Player has to clap their hands or make a sound to tap the note"
                ]
            },
            {
                "label": "VR Experience",
                "link": "https://virtualenvironments.itch.io/kenny-tran-vr-expereince",
                "description": "Recreated an old military base in Brisbane into a fantasy setting for VR.",
                "points": [
                    "Experienced development in VR using Unreal Engine 4's VR Blueprints"
                ]
            },
            {
                "label": "Spooky Factory",
                "link": "https://studiokaboom.itch.io/spooky-factory",
                "description": "After inheriting a deceased relatives’ factory, you discover it is haunted! Spirits are possessing the machinery and are not happy with your presence in the factory. Escape if you can!\n\nSpooky Factory is a first-person survival horror game. With no weapon or armor to defend yourself from the factory’s malicious intentions, you must evade and deactivate traps and animated machinery to get out alive.",
                "points": [
                    "As the programmer for the team, I was responsible for implementing the game mechanics and AI behaviours"
                ]
            }
        ]
    },
    {
        "title": "Projects",
        "entries": [
            {
                "label": "Custom Youtube Feed",
                "link": "",
                "description": "Wanted to create custom feed that has more control over what I want to see and how I want to see it.",
                "points": [
                    "Created mock-ups of the feed in Figma",
                    "Used Flutter to implement the feed",
                    "Using Python as the backend to scrape the data from YouTube and receiving push notifications when new videos are uploaded via Youtube's PubSub API",
                    "Using Supabase as the database to store the data"
                ]
            }
        ]
    }
]